In [1]:
import numpy as np
import pandas as pd
from numpy.random import randint

In [2]:
np.random.seed(42) #seed outputs the same 'random' int 
data = randint(-100,100,(5,4)) # shape
columns = ['W', 'X', 'Y', 'Z']
index = ['A', 'B', 'C', 'D','E']

In [3]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [4]:
df = pd.DataFrame(data, index,columns)

In [5]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [6]:
df>0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [7]:
df [df >0] #pandas can filter it using NaN

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [8]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [9]:
df['X']>0 #numbers in column x that are greater than 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [10]:
df[df['X']>0] #called broadcasting: conditional selections with pandas

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

Above shows dataframe results where numbers in column X were greater than 0

In [11]:
df.iloc[0] #iloc--> integer location of row

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

Selecting a single column (shown below)

In [12]:
df[df['X']>0]['W'] #df['X']>0 is a bool statement--which will be broadcasted to column 'W', grabbing a single column

A     2
C     2
E    30
Name: W, dtype: int64

In [13]:
df[(df['W']>0) & (df['Y']>1)] #to make into dataframe, pass these as a condition in df[]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [14]:
df.reset_index() #separates index into "index" and index int values, doesn't last

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [15]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [18]:
df['States'] = new_ind #you can add it as a column by doing df.loc[]

In [19]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [22]:
df = df.set_index('States') #states is the name of the index--it is not a column

In [24]:
df.columns #look at all columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [28]:
df.describe() #gives relevant infO

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes